"""
====================================
 :mod:alabs.pymgr.pimgr ARGOS-LABS Python VENV-Plugin Manager
====================================
.. moduleauthor:: Jerry Chae <mcchae@argos-labs.com>
.. note:: ARGOS-LABS
"""

# 작업 내용
# =========
#
#
#  alabs.pymgr.vmmgr 에 의해 관리되는 특정 플러그인/버전에 대한 관리
#  -
#
# 관련 작업자
# ===========
#
# 본 모듈은 다음과 같은 사람들이 관여했습니다:
#  * 채문창
#
# 작업일지
# --------
#
# 다음과 같은 작업 사항이 있었습니다:
#  * [2019/08/3]
#     - 본 모듈 작업 시작
################################################################################

import os

